#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-0886f96d9a9250518][0m
[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-0aff6cea4bf8113d7][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0587deb5744eb212c][0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0bbc087d532aaa467][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-2039825727][0m
[0m[1mdata.aws_subnets.data: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-5-subnet-group][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-3208287930][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1212953475][0m
[0m[1mdata.aws_subnets.web: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_efs_access_point.ga_ap_config2: Refreshing state... [id=fsap-0782bfe0ae7366428][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot1: Refreshing state... [id=fsap-001176ac0f6faa040][0m
[0m[1maws_efs_access_point.ga_ap_upgrader1: Refreshing state... [id=fsap-0638ba69ff9ac47f9][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot2: Refreshing state... [id=fsap-02a020798f271567d][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0d9c293adece0a725][0m
[0m[1mdata.aws_subnets.app: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver2: Refreshing state... [id=fsap-014ca07a679db7841][0m
[0m[1maws_efs_access_point.ga_ap_sharedconfig: Refreshing state... [id=fsap-01ed8537da5937a13][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog1: Refreshing state... [id=fsap-041a2c9803bcef554][0m
[0m[1maws_efs_access_point.ga_ap_config1: Refreshing state... [id=fsap-06694cead17c15cde][0m
[0m[1maws_efs_access_point.ga_ap_upgrader2: Refreshing state... [id=fsap-087c8878ac1be21cc][0m
[0m[1maws_efs_access_point.ga_ap_userdata: Refreshing state... [id=fsap-0e27ade4626d75511][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog2: Refreshing state... [id=fsap-007b0699e7a56d019][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver1: Refreshing state... [id=fsap-01200660879ab28b0][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-0ea508b4261662794][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-030350c445d3f34fc][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-YNGXTLUVHBWVMRFDYXY6BBBNIA][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_lb.ga-lb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb" "ga-lb" {
      [32m+[0m[0m arn                                                          = (known after apply)
      [32m+[0m[0m arn_suffix                                                   = (known after apply)
      [32m+[0m[0m desync_mitigation_mode                                       = "defensive"
      [32m+[0m[0m dns_name                                                     = (known after apply)
      [32m+[0m[0m drop_invalid_header_fields                                   = false
      [32m+[0m[0m enable_deletion_protection                                   = false
      [32m+[0m[0m enable_http2                                                 = true
      [32m+[0m[0m enable_tls_version_and_cipher_suite_headers                  = false
      [32m+[0m[0m enable_waf_fail_open                                         = false
      [32m+[0m[0m enable_xff_client_port                                       = false
      [32m+[0m[0m enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      [32m+[0m[0m id                                                           = (known after apply)
      [32m+[0m[0m idle_timeout                                                 = 60
      [32m+[0m[0m internal                                                     = true
      [32m+[0m[0m ip_address_type                                              = (known after apply)
      [32m+[0m[0m load_balancer_type                                           = "application"
      [32m+[0m[0m name                                                         = (sensitive value)
      [32m+[0m[0m name_prefix                                                  = (known after apply)
      [32m+[0m[0m preserve_host_header                                         = false
      [32m+[0m[0m security_groups                                              = [
          [32m+[0m[0m "sg-0587deb5744eb212c",
        ]
      [32m+[0m[0m subnets                                                      = [
          [32m+[0m[0m "subnet-0503aa6bf2f9c1701",
          [32m+[0m[0m "subnet-076671c51253def2e",
        ]
      [32m+[0m[0m tags                                                         = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = (sensitive value)
        }
      [32m+[0m[0m tags_all                                                     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "ga-issue-5-lb"
        }
      [32m+[0m[0m vpc_id                                                       = (known after apply)
      [32m+[0m[0m xff_header_processing_mode                                   = "append"
      [32m+[0m[0m zone_id                                                      = (known after apply)

      [32m+[0m[0m access_logs {
          [32m+[0m[0m enabled = false
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [31m-[0m[0m data_aws_subnets_web_ids = [
      [31m-[0m[0m "subnet-0503aa6bf2f9c1701",
      [31m-[0m[0m "subnet-076671c51253def2e",
    ] [90m-> null[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cedricguindon, Action: `pull_request`*